        01  TRANSDATA.
            05  CURRENCY          PIC X(3).
            05  SIGNATURE         PIC X(8).
            05  COMPANY-NAME-NP      PIC X(15).
            05  COMPANY-ID       PIC X(10).
            05  WEALTH-QFY        PIC 9(1).
            05  AMOUNT            PIC S9(09)V99  BINARY.
